Tekla Open API Reference for Tekla Structures 2025
Operation Class
 Operations for drawing objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.Operations.Operation
 Namespace: Tekla.Structures.Drawing.Operations
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Operation
Public Class Operation
The Operation type exposes the following members.
Constructors
Name | Description
Operation
Initializes a new instance of the Operation class
Top
Methods
Name | Description
MergeMarks
 Merges given marks objects.
NOTE!! Merge requires the original mark content to be similar and of same type. Operation does not support associative notes, mark sets or template content.
SortObjectsByPresentationOrder
 Sorts objects relatively by presentation order from active drawing. Result is used to define relative drawing order of objects which are on top of each other. Last object from the list is drawn on top of all objects.
SplitMarks
 Splits given marks to original marks.
Top
See Also
Reference
Tekla.Structures.Drawing.Operations Namespace